In [1]:
Company = 'GOOG GOOG MSFT MSFT FB FB'.split()

In [2]:
Company

['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB']

In [3]:
d = {'company' : Company}

In [4]:
d

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB']}

In [11]:
d.pop('sdfsd')

['sdkjfhjsdfjhs']

In [12]:
d

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB']}

In [13]:
isim = 'Sam Charlie Amy Vanessa Carl Sarah'.split()

In [17]:
isim

['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']

In [18]:
d['person'] = isim

In [19]:
d

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']}

In [20]:
d['Sales'] = [200,120,340,124,243,350]

In [21]:
d

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [23]:
import numpy as np
import pandas as pd

In [25]:
df = pd.DataFrame(d)

In [26]:
df

  company   person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [28]:
byComp = df.groupby('company')

In [29]:
byComp

In [30]:
byComp.sum()

         Sales
company
FB         593
GOOG       320
MSFT       464

In [31]:
byComp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [32]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [34]:
df.groupby('company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [37]:
df.groupby('company').max()

          person  Sales
company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [38]:
df.groupby('company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [39]:
df.groupby('company').describe().T

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [40]:
df.groupby('company').describe().T['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64